# coding utf-8
задачи на линейный алгоритм
#задача 1.

x=int(input())
y=7*x+5
print("y=", y)

#задача 2.
a=int(input("введите сторону квадрата"))
P=a*4
print("Периметр квадарата=", P)

#задача 3.
a=int(input("введите радиус"))
L=2*3.14*a
print("Длина окружности=", L)

#задача 4.
d=int(input("введите диаметр"))
S=3.14*0,25*d^2

print(S)
#задача 5.
a=int(input("введите катет A"))
b=int(input("введите катет B"))
G=a^2*b^2
G^0,5
print(G)

#Задача 6
a=int(input("введите катет A"))
b=int(input("введите катет B"))
P=0.5*a*b
print("Периметр=",P)

#Задача 7
a=int(input("введите сторону A"))
b=int(input("введите сторону B"))
P=(a+b)*2
d=a^2+b^2
d^1,2
print("Диагональ прямоугольника",d)
print("Периметр прямоугольника=",P)

#Задача 8
a=int(input("введите радиус внешней окружности A"))
b=int(input("введите радиус внутренней окружности B"))
S=3.14*(a^2-b^2)
print("Площадь кольца равна",S)

#Задача 9.
a=int(input("введите введите ребро A"))
S=6*a^2
V=a^3
print("площадь поверхности",S)
print("Объем куба",V)

#Задача 10.
a=int(input('Введите боковую сторону трапеции'))
b=int(input("введите верхнее основание"))
d=int(input("введите нижнеее основание"))
P=2*a+b+d
print("Периметр равнобедренной трапеции равен", P)
